{"date": "2024-09-21", "summaries": [{"title": "Sri Lanka votes in first election since protests ousted president", "link": "https://www.bbc.com/news/articles/ce3w2qkx1xlo", "summary": ["Sri Lankans are voting for a new president in the first election since mass protests sparked by the country's worst-ever economic crisis unseated the leader in 2022. The vote is widely regarded as a referendum on economic reforms meant to put the country on the road to recovery. However, many are still struggling to make ends meet because of tax hikes and cuts to subsidies and welfare."]}, {"title": "Top Hezbollah commander killed in Israeli strike on Beirut", "link": "https://www.bbc.com/news/articles/c5y9wyy9pr2o", "summary": ["A top Hezbollah military commander was killed in an Israeli air strike on the Lebanese capital Beirut on Friday, in a major escalation that has added to fears of an all-out war. Hezbollah confirmed Ibrahim Aqil's death after Israel said he was one of several senior Hezbollah figures killed in the strike. Earlier, Lebanese officials said at least 14 people were killed and dozens injured."]}, {"title": "Schoolboy's killing in China sparks Japanese fears", "link": "https://www.bbc.com/news/articles/ckg9nwxy388o", "summary": ["The killing of a 10-year-old Japanese schoolboy in the Chinese city of Shenzhen has sparked worry among Japanese expats living in China. Toshiba and Toyota have told their staff to take precautions against any possible violence, while Panasonic is offering its employees free flights home. Japanese authorities have repeated their condemnation of the killing while urging the Chinese government to ensure the safety of their citizens."]}, {"title": "India rejects report on transfer of ammunitions to Ukraine as 'speculative'", "link": "https://www.bbc.com/news/articles/c2dpxkknen5o", "summary": ["India has dismissed a news report claiming that the government failed to prevent European buyers from transferring Indian-made artillery shells to Ukraine. India's foreign ministry has called the report \"speculative\" and \"misleading\". The report \"implies violations by India, where none exist, and hence, is inaccurate and mischievous\", the ministry's spokesperson wrote on Twitter. It added that India has an \"impeccable track record compliance with international obligations\" on non-proliferation of arms."]}, {"title": "Mohamed Al Fayed: How culture of fear at Harrods protected a predator", "link": "https://www.bbc.com/news/articles/ce9j0kxgmvyo", "summary": ["More than 20 women have come forward to accuse former Harrods owner Mohamed Al Fayed of sexually assaulting or raping them while they worked at the luxury London department store. \"He just had that power – I am petrified of someone who is no longer alive,\" said one of the women. \"I finally have the opportunity to speak up for my daughters,\" said another victim."]}]}